In [1]:
import pandas as pd
from pandas_datareader import data as wb

In [3]:
stocks = ["MSFT", "GOOG", "AAPL", "YHOO", "AMZN"]
start = "2010-01-01"
end = "2016-12-31"
mydata = pd.DataFrame()
for stock in stocks:
    mydata[stock] = wb.DataReader(stock, 'google', start=start, end=end)['Close']

In [5]:
mydata.head()

             MSFT    GOOG   AAPL   YHOO    AMZN
Date
2010-01-04  30.95  313.06  30.57  17.10  133.90
2010-01-05  30.96  311.68  30.63  17.23  134.69
2010-01-06  30.77  303.83  30.14  17.17  132.25
2010-01-07  30.45  296.75  30.08  16.70  130.00
2010-01-08  30.66  300.71  30.28  16.70  133.52

In [7]:
companies = ["MSFT", "GOOG", "AAPL", "YHOO", "AMZN"]
panel = wb.DataReader(name=companies, data_source='google', start=start, end=end)
panel

<class 'pandas.core.panel.Panel'>
Dimensions: 5 (items) x 1761 (major_axis) x 5 (minor_axis)
Items axis: Open to Volume
Major_axis axis: 2010-01-04 00:00:00 to 2016-12-30 00:00:00
Minor_axis axis: AAPL to YHOO

### the first dimension 
- items

In [8]:
panel.items

Index(['Open', 'High', 'Low', 'Close', 'Volume'], dtype='object')

### The 2nd dimension

In [9]:
panel.major_axis

DatetimeIndex(['2010-01-04', '2010-01-05', '2010-01-06', '2010-01-07',
               '2010-01-08', '2010-01-11', '2010-01-12', '2010-01-13',
               '2010-01-14', '2010-01-15',
               ...
               '2016-12-16', '2016-12-19', '2016-12-20', '2016-12-21',
               '2016-12-22', '2016-12-23', '2016-12-27', '2016-12-28',
               '2016-12-29', '2016-12-30'],
              dtype='datetime64[ns]', name='Date', length=1761, freq=None)

### The 3rd dimension

In [10]:
panel.minor_axis

Index(['AAPL', 'AMZN', 'GOOG', 'MSFT', 'YHOO'], dtype='object')

### Axes

In [11]:
panel.axes

[Index(['Open', 'High', 'Low', 'Close', 'Volume'], dtype='object'),
 DatetimeIndex(['2010-01-04', '2010-01-05', '2010-01-06', '2010-01-07',
                '2010-01-08', '2010-01-11', '2010-01-12', '2010-01-13',
                '2010-01-14', '2010-01-15',
                ...
                '2016-12-16', '2016-12-19', '2016-12-20', '2016-12-21',
                '2016-12-22', '2016-12-23', '2016-12-27', '2016-12-28',
                '2016-12-29', '2016-12-30'],
               dtype='datetime64[ns]', name='Date', length=1761, freq=None),
 Index(['AAPL', 'AMZN', 'GOOG', 'MSFT', 'YHOO'], dtype='object')]

In [12]:
panel.ndim

3

In [13]:
panel.dtypes

Open      float64
High      float64
Low       float64
Close     float64
Volume    float64
dtype: object

In [15]:
panel.shape

(5, 1761, 5)

In [17]:
panel['Open'].head()

             AAPL    AMZN    GOOG   MSFT   YHOO
Date
2010-01-04  30.49  136.25  313.16  30.62  16.94
2010-01-05  30.66  133.43  313.28  30.85  17.22
2010-01-06  30.63  134.60  312.62  30.88  17.17
2010-01-07  30.25  132.01  304.40  30.63  16.81
2010-01-08  30.04  130.56  295.70  30.28  16.68

In [26]:
panel.loc['Close', '2016-02-01','GOOG']

752.0

### Convert panel to dataframe
- items: columns
- Major and minor axis: index

In [29]:
df = panel.to_frame()
df.head(10)

                    Open    High     Low   Close       Volume
Date       minor
2010-01-04 AAPL    30.49   30.64   30.34   30.57  123432050.0
           AMZN   136.25  136.61  133.14  133.90    7600543.0
           MSFT    30.62   31.10   30.59   30.95   38414185.0
           YHOO    16.94   17.20   16.88   17.10   16588957.0
2010-01-05 AAPL    30.66   30.80   30.46   30.63  150476004.0
           AMZN   133.43  135.48  131.81  134.69    8856456.0
           MSFT    30.85   31.10   30.64   30.96   49758862.0
           YHOO    17.22   17.23   17.00   17.23   11718126.0
2010-01-06 AAPL    30.63   30.75   30.11   30.14  138039594.0
           AMZN   134.60  134.73  131.65  132.25    7180977.0

### Major_xs conversion of the panel

In [31]:
panel.major_xs('2012-02-01')

        Open    High     Low   Close      Volume
AAPL   65.49   65.57   65.08   65.17  67510562.0
AMZN  173.81  179.95  172.00  179.46  21341033.0
GOOG  292.18  292.46  289.28  290.12         NaN
MSFT   29.79   30.05   29.76   29.89  67413817.0
YHOO   15.57   15.80   15.53   15.73  13223197.0

### Minor_xs method

In [33]:
panel.minor_xs('AMZN').head()

              Open    High     Low   Close      Volume
Date
2010-01-04  136.25  136.61  133.14  133.90   7600543.0
2010-01-05  133.43  135.48  131.81  134.69   8856456.0
2010-01-06  134.60  134.73  131.65  132.25   7180977.0
2010-01-07  132.01  132.32  128.80  130.00  11030124.0
2010-01-08  130.56  133.68  129.03  133.52   9833829.0

### Item axis: use the bracket

In [36]:
panel['Open'].head()

             AAPL    AMZN    GOOG   MSFT   YHOO
Date
2010-01-04  30.49  136.25  313.16  30.62  16.94
2010-01-05  30.66  133.43  313.28  30.85  17.22
2010-01-06  30.63  134.60  312.62  30.88  17.17
2010-01-07  30.25  132.01  304.40  30.63  16.81
2010-01-08  30.04  130.56  295.70  30.28  16.68

In [1]:
import pandas as pd
from pandas_datareader import data as wb

In [3]:
stocks = ["MSFT", "GOOG", "AAPL", "YHOO", "AMZN"]
start = "2010-01-01"
end = "2016-12-31"
mydata = pd.DataFrame()
for stock in stocks:
    mydata[stock] = wb.DataReader(stock, 'google', start=start, end=end)['Close']

In [5]:
mydata.head()

             MSFT    GOOG   AAPL   YHOO    AMZN
Date
2010-01-04  30.95  313.06  30.57  17.10  133.90
2010-01-05  30.96  311.68  30.63  17.23  134.69
2010-01-06  30.77  303.83  30.14  17.17  132.25
2010-01-07  30.45  296.75  30.08  16.70  130.00
2010-01-08  30.66  300.71  30.28  16.70  133.52

In [7]:
stocks = ["MSFT", "GOOG", "AAPL", "YHOO", "AMZN"]
start = "2010-01-01"
end = "2016-12-31"
panel = wb.DataReader(stocks, 'google', start=start, end=end)
panel

<class 'pandas.core.panel.Panel'>
Dimensions: 5 (items) x 1761 (major_axis) x 5 (minor_axis)
Items axis: Open to Volume
Major_axis axis: 2010-01-04 00:00:00 to 2016-12-30 00:00:00
Minor_axis axis: AAPL to YHOO

In [9]:
panel['Open']
panel.major_xs('2012-02-01')

        Open    High     Low   Close      Volume
AAPL   65.49   65.57   65.08   65.17  67510562.0
AMZN  173.81  179.95  172.00  179.46  21341033.0
GOOG  292.18  292.46  289.28  290.12         NaN
MSFT   29.79   30.05   29.76   29.89  67413817.0
YHOO   15.57   15.80   15.53   15.73  13223197.0

# Transpose

In [12]:
p2 = panel.transpose(2,1,0)
p2

<class 'pandas.core.panel.Panel'>
Dimensions: 5 (items) x 1761 (major_axis) x 5 (minor_axis)
Items axis: AAPL to YHOO
Major_axis axis: 2010-01-04 00:00:00 to 2016-12-30 00:00:00
Minor_axis axis: Open to Volume

In [14]:
p2['YHOO'].head()

             Open   High    Low  Close      Volume
Date
2010-01-04  16.94  17.20  16.88  17.10  16588957.0
2010-01-05  17.22  17.23  17.00  17.23  11718126.0
2010-01-06  17.17  17.30  17.07  17.17  16421960.0
2010-01-07  16.81  16.90  16.57  16.70  31816301.0
2010-01-08  16.68  16.76  16.62  16.70  15471074.0

In [16]:
p2.major_xs('2012-02-01')

               AAPL         AMZN    GOOG         MSFT         YHOO
Open          65.49       173.81  292.18        29.79        15.57
High          65.57       179.95  292.46        30.05        15.80
Low           65.08       172.00  289.28        29.76        15.53
Close         65.17       179.46  290.12        29.89        15.73
Volume  67510562.00  21341033.00     NaN  67413817.00  13223197.00

# swapaxes method

In [18]:
p3 = panel.swapaxes('items', 'minor')
p3

<class 'pandas.core.panel.Panel'>
Dimensions: 5 (items) x 1761 (major_axis) x 5 (minor_axis)
Items axis: AAPL to YHOO
Major_axis axis: 2010-01-04 00:00:00 to 2016-12-30 00:00:00
Minor_axis axis: Open to Volume

In [22]:
p3['AAPL'].head()

             Open   High    Low  Close       Volume
Date
2010-01-04  30.49  30.64  30.34  30.57  123432050.0
2010-01-05  30.66  30.80  30.46  30.63  150476004.0
2010-01-06  30.63  30.75  30.11  30.14  138039594.0
2010-01-07  30.25  30.29  29.86  30.08  119282324.0
2010-01-08  30.04  30.29  29.87  30.28  111969081.0